Moved the diagrams inline into the README
Switched them from PlantUML to Mermaid.js so that they could be inlined better in the README.md.
