--- a/README.md
+++ b/README.md
@@ -23,25 +23,14 @@ transformations before being disposed of.
 
-<div hidden>
-
+```mermaid
+graph TD
+    A((start))-->|"Data Chunk(s)"| B[Data Transformation]
+    B -->|"Data Chunk(s)"| C[Output Generation]
+    C -->|"Output Chunk(s)"| D[Output Transformation]
+    D -->|"Output Chunk(s)"| E[Output Disposition]
+    E -->|"Result Chunk(s)"| F((end))
 ```
-
-@startuml SimpleOverview
-
@@ -56,30 +45,19 @@ that consists of multiple Data Transformation steps.  It's possible, if a little
 
-<div hidden>
-
+```mermaid
+graph TD
+    subgraph Child Transformations
+        B1[Child Data Transformation 1] ---> B2[Child Data Transformation 2] --> B3[Child Data Transformation 3]
+    end
+    A((start))-->|"Data Chunk(s)"| B[Data Transformation]
+    B -->|"Data Chunk(s)"| C[Output Generation]
+    B --> B1
+    B3 --> B
+    C -->|"Output Chunk(s)"| D[Output Transformation]
+    D -->|"Output Chunk(s)"| E[Output Disposition]
+    E -->|"Result Chunk(s)"| F((end))
 ```
-
-@startuml DataOverview
-
-(*) -->[Data Chunk(s)] "Aggregate Data Transformation"
--right-> "Child Data Transformation 1"
---> "Child Data Transformation 2"
---> "Child Data Transformation 3"
---> "Aggregate Data Transformation"
--->[Data Chunk(s)] "Output Generation"
--->[Output Chunk(s)] "Output Transformation"
--->[Output Chunk(s)] "Output Disposition"
--->[Result Chunk(s)] (*)
-
-@enduml
-
-```
-
@@ -138,31 +105,22 @@ The result of the Output Disposition is then returned as an "result chunk".
+    E -->|"Result Chunk(s)"| F((end))
 ```
-
-@startuml DispositionOverview
-
-(*) -->[Data Chunk(s)] "Data Transformation"
--->[Data Chunk(s)] "Output Generation"
--->[Output Chunk(s)] "Output Transformation"
--->[Output Chunk(s)] "Output Disposition"
-"Output Disposition" -down->[Result Chunk(s)] (*)
-"Output Disposition" -right-> "Child Output Disposition 1"
---> "Output Disposition"
-"Output Disposition" -right-> "Child Output Disposition 2"
---> "Output Disposition"
-"Output Disposition" -right-> "Child Output Disposition 3"
---> "Output Disposition"
-
-@enduml
-
-```
-
